// lab_12_v6.cpp : This file contains the 'main' function. Program execution begins and ends there.
//
// Вариант №6.
/*
Информация о студентах размещается в двух двоичных файлах.
В первом файле:
фамилия,
имя,
отчество,
курс,
оценки
	по физике,
	математике,
	программированию.
Во втором файле для тех же студентов в том же порядке:
фамилия,
имя,
отчество,
пол,
год рождения.
Отсортировать записи в обоих файлах по возрастанию количества пятёрок по всем предметам.
Вывести на экран фамилии студентов первого курса,
у которых количество пятёрок больше указанного пользователем значения.
*/

#include <iostream>

int main()
{

}
