// lab_14_v6.cpp : This file contains the 'main' function. Program execution begins and ends there.
//
// Вариант 6
/*
Разработать шаблон класса «Двусвязный список»,
включающий в себя необходимый минимум методов,
обеспечивающий полноценное функционирование объектов указанного класса
при их использовании в программе, а именно:
	1) конструкторы(по умолчанию, с параметрами, копирования);
	2) деструктор;
	3) добавление элемента в начало, конец, заданную(по номеру) позицию списка;
	4) удаление элемента из начала, конца, заданной(по номеру) позиции списка;
	5) поиск элемента – по значению и по номеру;
	6) вывод списка на экран.
Разработать программу, содержащую меню, которое позволяет протестировать функции
добавления, удаления, поиска и вывода на экран элементов списка.
В качестве отдельного пункта меню добавить решение задачи в соответствии со своим вариантом.
При необходимости в разработанный шаблон класса добавить дополнительные методы,
если того требует решение задачи.

Вариант №6.
Построить список из входной последовательности вещественных чисел.
Вывести список на экран.
Перестроить список, расположив узлы списка в порядке убывания числовых значений.
Вывести список на экран.
*/

#include <iostream>

int main()
{
	return 0;
}
